package vitily.com.consts;


/**
 * 资金流水类型：4位数
 * 对于用户来说，收入的，以2开头，支出的，以3开头
 * 对于平台来说，收入的，以2结尾，支出的，以3结尾
 *
 */
public enum FundsTypeDesc {
	//income
	充值(2000,"充值"),//收入，一笔
	后台充值(2010,"后台充值"),//收入，两笔
	线下打款(2330,"线下打款"),//收入，一笔
	提现申请驳回资金返还(2100,"提现申请驳回资金返还"),//收入，一笔
	审核发布体验秀不通过(2200,"审核发布体验秀不通过"),//收入，一笔
	取消任务返还金额(2300,"取消任务返还金额"),//收入，一笔

	推荐奖励(2023,"推荐奖励"),//收入<--平台，两笔
	红包奖励(2033,"红包奖励"),//收入<--平台，两笔
	活动奖励(2043,"活动奖励"),//收入<--平台，两笔
	推荐人发布奖励(2053,"推荐人发布奖励"),//收入<--平台，两笔
	推荐人升级VIP奖励(2063,"推荐人升级VIP奖励"),//收入<--平台，两笔
	佣金获利(2073,"佣金获利"),//收入<--平台，两笔
	模特推荐人享受分润提成(2083,"模特推荐人享受分润提成"),//收入<--平台，两笔
	产品本金返还(2093,"产品本金返还"),//收入<--平台，两笔

	//outcome
	提现申请(3000,"提现申请"),//支出，一笔
	活动体验(3020,"活动体验"),//支出，一笔
	线下提现申请(3010,"线下提现申请"),//支出，一笔
	提现成功(3100,"提现成功"),//支出，一笔，金额必须为0
	委托扣款(3002,"委托扣款"),//支出 --->平台，两笔
	发布体验秀(3030,"发布体验秀"),//支出，一笔
	审核发布体验秀通过(3070,"审核发布体验秀通过"),//支出，一笔
	商家升级VIP(3090,"商家升级VIP"),//支出，一笔

	;
	private final int value;
	private final String desc;
	FundsTypeDesc(int value, String desc){
		this.value=value;
		this.desc=desc;
	}
	public int getValue() {
		return value;
	}
	public String getDesc() {
		return desc;
	}
}
